VV_cases/V2_thermal/results/study_v2a/runs/004_data_v2a_ogrid_cylinder_validation/simulations/Re40_ogrid/openfoam_setup/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0.01;
    }
    p_rghFinal
    {
        $p_rgh;
        relTol          0;
        tolerance       1e-9;
    }

    "(U|T)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1;
    }
    "(U|T)Final"
    {
        $U;
        relTol          0;
        tolerance       1e-9;
    }
}

PIMPLE
{
    momentumPredictor no;
    nOuterCorrectors        1;
    nCorrectors             2;
    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        U     { tolerance 1e-5; relTol 0; }
        p_rgh { tolerance 1e-5; relTol 0; }
        T     { tolerance 1e-5; relTol 0; }
    }
}

relaxationFactors
{
    equations
    {
        U       0.9;
        UFinal  1.0;
        T       0.9;
        TFinal  1.0;
    }
}
